## Data Wrangling

#### Create Dataframe

In [2]:
import pandas as pd

df = pd.DataFrame()

# Add columns
df['Name'] = ['Jacky Jackson', 'Steven Stevenson']
df['Age'] = [38, 25]
df['Driver'] = [True, False]

# create row
new_person = pd.Series(['Molly Brown', 25, False],
                       index = ['Name', 'Age', 'Driver'])

# add new row to df
df.append(new_person, ignore_index = True)
df.append(new_person, ignore_index=True)

               Name  Age  Driver
0     Jacky Jackson   38    True
1  Steven Stevenson   25   False
2       Molly Brown   25   False

#### Describe Data

In [3]:
df.info()
df.describe()
df.shape
df.keys()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
Name      2 non-null object
Age       2 non-null int64
Driver    2 non-null bool
dtypes: bool(1), int64(1), object(1)
memory usage: 114.0+ bytes

Index(['Name', 'Age', 'Driver'], dtype='object')

#### Navigating Dataframe

In [5]:
import pandas as pd

# load csv file
url = 'https://tinyurl.com/titanic-csv'
titanic = pd.read_csv(url) 

titanic.iloc[0] # select first row
titanic.iloc[:3] # select first 3 rows
titanic.iloc[4:6] # select 4 and 5th rows

                            Name PClass    Age   Sex  Survived  SexCode
4  Allison, Master Hudson Trevor    1st   0.92  male         1        0
5             Anderson, Mr Harry    1st  47.00  male         1        0

#### Filtering rows based on Conditionals

In [6]:
titanic[(titanic['Sex'] == 'female') & (titanic['Age'] >=65)]

,Name,PClass,Age,Sex,Survived,SexCode
73,"Crosby, Mrs Edward Gifford (Catherine Elizabet...",1st,69.0,female,1,1

#### Replacing Values

In [7]:
titanic['Sex'].replace(['female', 'male'], ['woman', 'man']).head()

titanic['PClass'].replace(['1st', '2nd', '3rd'], ['first', 'second', 'third']).head()

titanic['Survived'].replace([1,0], ['Yes', 'No']).head()

0    Yes
1     No
2     No
3     No
4    Yes
Name: Survived, dtype: object

#### Renaming Columns

In [8]:
titanic.rename(columns ={'PClass': 'Passenger Class', 'Sex':'Gender'}).head()

,Name,Passenger Class,Age,Gender,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

#### Find min, max, sum, average, count

In [9]:
titanic['Age'].max()
titanic['Age'].min()
titanic['Age'].mean()
titanic['Age'].sum()
titanic.count()

titanic['Sex'].unique() # get classes variables
titanic['Sex'].nunique() # get number of different classes
titanic['Sex'].value_counts() # count elements by classes

male      851
female    462
Name: Sex, dtype: int64

####  Handling missing values

In [11]:
import numpy as np

# find missing values in column
titanic[(titanic['Age'].isnull())].head()

# replace values with nan
titanic['Sex'].replace("male", np.nan).head()

0    female
1    female
2       NaN
3    female
4       NaN
Name: Sex, dtype: object

#### Deleting Columns and Rows

In [12]:
titanic.drop(['SexCode'], axis=1).head() # delete columns

titanic[(titanic['Sex'] != 'male')].head() # delete all male rows
titanic[(titanic['Age'] <=1)].head()

                              Name PClass   Age     Sex  Survived  SexCode
4    Allison, Master Hudson Trevor    1st  0.92    male         1        0
339       Becker, Master Richard F    2nd  1.00    male         1        0
358   Caldwell, Master Alden Gates    2nd  0.83    male         1        0
425       Hamalainen, Master Viljo    2nd  1.00    male         1        0
478           LaRoche, Miss Louise    2nd  1.00  female         1        1

#### Drop Duplicate Rows

In [13]:
titanic.drop_duplicates().head()

print("Number Of Rows In The Original DataFrame:", len(titanic))
print("Number Of Rows After Deduping:", len(titanic.drop_duplicates()))

titanic.drop_duplicates(subset=['Sex'], keep='last')

Number Of Rows In The Original DataFrame: 1313
Number Of Rows After Deduping: 1313

                     Name PClass   Age     Sex  Survived  SexCode
1307  Zabour, Miss Tamini    3rd   NaN  female         0        1
1312       Zimmerman, Leo    3rd  29.0    male         0        0

#### Group By

In [14]:
titanic.groupby(['Sex']).count()
titanic.groupby(['Sex']).mean()

titanic.groupby(['Survived'])['PClass'].count()
titanic.groupby(['Sex', 'Survived', 'PClass'])['Age'].mean()

Sex     Survived  PClass
female  0         1st       35.200000
                  2nd       31.400000
                  3rd       22.821429
        1         1st       37.906250
                  2nd       26.853333
                  3rd       22.721087
male    0         *               NaN
                  1st       44.841463
                  2nd       31.698113
                  3rd       27.099620
        1         1st       34.253953
                  2nd       14.839524
                  3rd       22.088437
Name: Age, dtype: float64

#### Grouping Rows by Time

In [15]:
# create date range
time_index = pd.date_range('06/06/2017', periods=100000, freq='30S')

# Create DataFrame
dataframe = pd.DataFrame(index=time_index)

# create column of random values
dataframe['Sales'] = np.random.randint(1000, 2000, 100000)

# Group rows by week and calculate sum
dataframe.resample('W').sum()

               Sales
2017-06-11  25856493
2017-06-18  30260403
2017-06-25  30143195
2017-07-02  30143282
2017-07-09  30211265
2017-07-16   3103828

#### Looping over columns

In [16]:
for name in titanic['Name'][0:3]:
    print(name.upper())

ALLEN, MISS ELISABETH WALTON
ALLISON, MISS HELEN LORAINE
ALLISON, MR HUDSON JOSHUA CREIGHTON

#### Apply function on all elements

In [17]:
# create function
def uppercase(x):
    return x.upper()

# apply function on all elements
titanic['Name'].apply(uppercase)[0:4]

# applyc function by groups
titanic.groupby('Sex').apply(lambda x: x.count())

        Name  PClass  Age  Sex  Survived  SexCode
Sex
female   462     462  288  462       462      462
male     851     851  468  851       851      851

#### Concatenating dataframe by rows

In [18]:
# Create DataFrame A
data_a = {'id': ['1', '2', '3'],
 'first': ['Alex', 'Amy', 'Allen'],
 'last': ['Anderson', 'Ackerman', 'Ali']}
dataframe_a = pd.DataFrame(data_a, columns = ['id', 'first', 'last'])

# Create DataFrame B
data_b = {'id': ['4', '5', '6'],
 'first': ['Billy', 'Brian', 'Bran'],
 'last': ['Bonder', 'Black', 'Balwner']}
dataframe_b = pd.DataFrame(data_b, columns = ['id', 'first', 'last'])


# Concatenate DataFrames by rows
pd.concat([dataframe_a, dataframe_b], axis=0)

  id  first      last
0  1   Alex  Anderson
1  2    Amy  Ackerman
2  3  Allen       Ali
0  4  Billy    Bonder
1  5  Brian     Black
2  6   Bran   Balwner

#### Merging Dataframe by columns

In [19]:
# Create DataFrame A
employee_data = {'employee_id': ['1', '2', '3', '4'],
 'name': ['Amy Jones', 'Allen Keys', 'Alice Bees',
 'Tim Horton']}
dataframe_employees = pd.DataFrame(employee_data, columns = ['employee_id',
 'name'])

# Create DataFrame B
sales_data = {'employee_id': ['3', '4', '5', '6'],
 'total_sales': [23456, 2512, 2345, 1455]}
dataframe_sales = pd.DataFrame(sales_data, columns = ['employee_id',
 'total_sales'])

# Merge DataFrames
pd.merge(dataframe_employees, dataframe_sales, on='employee_id')

  employee_id        name  total_sales
0           3  Alice Bees        23456
1           4  Tim Horton         2512